app/views/applicants/index.html.erb

          <td>
            <% applicant.comments.each do |applicant_comments| %>
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`applicant_id` = 2