app/controllers/applicants_controller.rb

SELECT `applicants`.* FROM `applicants`
---
  def index
    @applicants = Applicant.all

INSERT INTO `applicants` (`address`, `comment`, `contact`, `created_at`, `dob`, `edu`, `fname`, `name`, `updated_at`, `username`) VALUES ('sanganer', 'applicant', '9799422558', '2014-02-06 17:25:51', '16/08/1990', '72', 'suresh kumar', 'amit', '2014-02-06 17:25:51', 'amit')
---
  def create
    @applicant = Applicant.new(applicant_params)

    respond_to do |format|
      if @applicant.save

SELECT `applicants`.* FROM `applicants` WHERE `applicants`.`id` = 1 LIMIT 1
---
    def set_applicant
      @applicant = Applicant.find(params[:id])     unless params[:username]