app/controllers/comments_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `user_id`) VALUES ('hi this is amit', '2014-02-06 16:52:50', '2014-02-06 16:52:50', 1)
---
	def create
    if session[:user_id]
    	@user = User.find(params[:user_id])
      @comment = @user.comments.create(comment_params)